---
kind: method
id: M:Autodesk.Revit.DB.Structure.PathReinforcement.GetHostId
source: html/61909903-e670-132a-cd41-07f85ff6302b.htm
---
# Autodesk.Revit.DB.Structure.PathReinforcement.GetHostId Method

The element that contains the Path Reinforcement.

## Syntax (C#)
```csharp
public ElementId GetHostId()
```

## Returns
The element that the Path Reinforcement object belongs to, such as a structural
 wall, floor or foundation.